#  - булочки
#  - котлеты
#  - огурчика
#  - помидорчика
#  - майонеза
#  - сыра
'''

Бифштексы из говядины рубленые, приготовленные на гриле
Булочка для гамбургеров, поджаренная в тостере
Горчичный соус
Лук репчатый свежий резаный
Огурцы маринованные резанные
Плавленый сыр Чеддер
Приправа для гриля

'''
def bun_top():
    print('Накроем булочкой')
def bun_bottom():
    print('Начнем с булочки')
def cutlets():
    print('Добавим говяжью котлету')
def cucumber():
    print('Кусочек огурчика')
def tomato():
    print('Немного помидора')
def mayonnaise():
    print('Слой майонеза')
def cheese():
    print('Ломтик сыра')
def mustard_sauce():
    print('Добавим горчичный соус')
def onion():
    print('Немного репчатого лука')
def cheddar():
    print('Ломтик чедарра')
def grill_seasoning():
    print('Приправа для грилля')
def ketchup():
    print('Намажем кетчупа')